dual_coco_edges = [
    """
    coco关键点原定义
    1 鼻子
    2 左眼
    3 右眼
    4 左耳
    5 右耳
    6 左肩
    7 右肩
    8 左肘
    9 右肘
    10 左手
    11 右手
    12 左胯
    13 右胯
    14 左膝
    15 右膝
    16 左脚
    17 右脚

    对于对偶图，定义主要骨骼边（对偶图的节点）
    [start_point, end_point, edge_index]
"""[6, 7, 0],  # 肩线
    [12, 13, 1],  # 胯线
    [6, 12, 2],  # 左躯干
    [7, 13, 3],  # 右躯干
    [1, 6, 4],  # 左颈部
    [1, 7, 5],  # 右颈部
    # 手臂
    [6, 8, 6],  # 左上臂
    [8, 10, 7],  # 左前臂
    [7, 9, 8],  # 右上臂
    [9, 11, 9],  # 右前臂
    # 腿部
    [12, 14, 10],  # 左大腿
    [14, 16, 11],  # 左小腿
    [13, 15, 12],  # 右大腿
    [15, 17, 13],  # 右小腿
]

# 定义对偶图中的连接关系（基于点线对偶）
neighbor_link = [
    # 鼻子
    (4, 5),  # 鼻子
    # 肩线
    (0, 2),  # 左肩
    (0, 3),  # 右肩
    (0, 4),  # 左肩
    (0, 5),  # 右肩
    (0, 6),  # 左肩
    (0, 8),  # 右肩
    (2, 4),  # 左肩
    (2, 6),  # 左肩
    (3, 5),  # 右肩
    (3, 8),  # 右肩
    (4, 6),  # 左肩
    (5, 8),  # 右肩
    # 肘
    (6, 7),  # 左肘
    (8, 9),  # 右肘
    # 胯
    (1, 2),  # 左胯
    (1, 3),  # 右胯
    (1, 10),  # 左胯
    (1, 12),  # 右胯
    (2, 10),  # 左胯
    (3, 12),  # 右胯
    # 膝
    (10, 11),  # 左膝
    (12, 13),  # 右膝
]
